#include <iostream>   // C++ 语言定义了一些头文件，这些头文件包含了程序中必需的或有用的信息
using namespace std;  // 告诉编译器使用 std 命名空间。命名空间是 C++ 中一个相对新的概念
int main()           // 块是一组使用大括号括起来的按逻辑连接的语句
{
	cout << "hello world\n";
	return 0;        //  终止 main( )函数，并向调用进程返回值 0
}
/* 这是注释 */      // 块注释符（/*...*/）是不可以嵌套使用的
// 此外，我们还可以使用 #if 0 ... #endif 来实现注释，且可以实现嵌套，格式为：
#if 0
int main()           // 块是一组使用大括号括起来的按逻辑连接的语句
{
	cout << "hello world\n";
	return 0;        //  终止 main( )函数，并向调用进程返回值 0
}
#endif
// 测试时使用 #if 1 来执行测试代码，发布后使用 #if 0 来屏蔽测试代码。